var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["T0", "T1", "T2", "T3","T4"],
        "N": ["NX","N0","N1","N2"]
      },
    
      "Table": {
        "T0_N0_M0": "Ⅰ",
        "T1_N0_M0": "Ⅰ",         
        "T2_N0_M0": "Ⅰ", 
        "T0_N1_M0": "Ⅰ",
        "T1_N1_M0": "Ⅰ",
        "T2_N1_M0": "Ⅰ", 

        "T0_N2_M0": "Ⅱ",
        "T1_N2_M0": "Ⅱ",
        "T2_N2_M0": "Ⅱ", 

        "T3_N0_M0": "Ⅱ",
        "T3_N1_M0": "Ⅱ",
        "T4_N0_M0": "Ⅱ",
        "T4_N1_M0": "Ⅱ",

        "T3_N2_M0": "Ⅲ",
        "T4_N2_M0": "Ⅲ",          
    
        "AnyT_AnyN_M1": "Ⅳ"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"
      },

      "T": {
        "T0":"无原发肿瘤存在证据",       
        "T1":"肿瘤最大径≤2cm",          
        "T2": "2cm＜肿瘤最大径≤4cm",       
        "T3": "肿瘤最大径＞4cm，或者侵犯至会厌舌面", 
        "T4": "中度进展期，肿瘤侵犯喉、舌肌、翼内肌、硬腭、下颌骨"
      },
      "N": {
        "NX":"无法评估有无区域性淋巴结转移",
        "N0":"无区域淋巴结转移",       
        "N1": "≤4 个淋巴结转移",
        "N2": "超过4个淋巴结转移"        
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

