var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "Ta", "Tis", "T1", "T2",  "T3", "T4"],
        "N": ["NX", "N0", "N1", "N2"]
      },

      "Table": {
        "Ta_N0_M0": "0a",  
        "Tis_N0_M0": "0is",  
        "T1_N0_M0": "Ⅰ",
        
        "T2_N0_M0": "Ⅱ",

        "T3_N0_M0": "Ⅲ",

        "T4_N0_M0": "Ⅳ",
       

        "AnyT_N1_M0": "Ⅳ",
        "AnyT_N2_M0": "Ⅳ",
  
        "AnyT_AnyN_M1": "Ⅳ"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"    
      },
      "T": {
        "TX": "原发肿瘤无法评估",
        "T0": "无原发肿瘤证据",
        "Ta": "非浸润性乳头状尿路上皮癌",
        "Tis": "原位癌",
        "T1": "肿瘤侵及上皮下组织",
        "T2": "肿瘤侵及肌层",
        
        "T3": "肾盏：肿瘤侵犯超过肌层至肾盂周围脂肪组织，或至肾实质；输尿管：肿瘤侵犯超出肌层至输尿管周围脂肪组织",

        "T4": "肿瘤侵及邻近器官，或穿过肾脏至肾脏周围脂肪组织"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N1": "单个区域淋巴结转移，最大径≤2cm",
        "N2": "单个区域淋巴结转移，最大径＞2cm；或多个淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

