var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1a", "T1b", "T2", "T3", "T4"],
        "N": ["NX", "N0", "N1"]
      },
      
      "Table": {
        "T1a_N0_M0": "IA",
        "T1b_N0_M0": "IB",
        "T2_N0_M0": "II",
        "T3_N0_M0": "IIIA",
        "T4_N0_M0": "IIIB",
        "N1_M0": "IVA",
        "M1": "IVB",
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1a":"孤立的肿瘤最大径≤2cm",
        "T1b":"孤立的肿瘤最大径＞2cm 无血管侵犯",
        "T2":"孤立的肿瘤最大径＞2cm,有血管侵犯；或者多发的肿瘤，无一最大径＞5cm",
        "T3":"多发的肿瘤，至少有一个最大径＞5cm",
        "T4": "任意大小的单发或多发肿瘤，累及门静脉的主要分支或者肝静脉；肿瘤直接侵及除胆囊外的邻近器官，或穿透腹膜"
      },
      "N": {
        "NX":"淋巴结转移情况无法判断",
        "N0":"无区域淋巴结转移",
        "N1":"区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

