var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1", "M1a", "M1b"],
        "T": ["TX", "T0", "T1", "T1a", "T1b", "T1c",  "T1c1", "T1c2", "T1c3", "T2", "T2a", "T2b", "T3", "T3a", "T3b", "T3c"],
        "N": ["NX", "N0", "N0i+", "N1", "N1a", "N1b"]
      },
    
      "Table": {
        "T1_N0_M0": "Ⅰ",
        "T1a_N0_M0": "ⅠA",  
        "T1b_N0_M0": "ⅠB",  
        "T1c_N0_M0": "ⅠC", 
        "T11_N0_M0": "ⅠC", 
        "T1c2_N0_M0": "ⅠC", 
        "T1c3_N0_M0": "ⅠC", 

        "T1_N0i+_M0": "Ⅰ",
        "T1a_N0i+_M0": "ⅠA",
        "T1b_N0i+_M0": "ⅠB",
        "T1c_N0i+_M0": "ⅠC", 
        "T1c1_N0i+_M0": "ⅠC", 
        "T1c2_N0i+_M0": "ⅠC", 
        "T1c3_N0i+_M0": "ⅠC", 

        "T2_N0_M0": "Ⅱ",
        "T2a_N0_M0": "ⅡA",
        "T2b_N0_M0": "ⅡB",

        "T2_N0i+_M0": "Ⅱ",
        "T2a_N0i+_M0": "ⅡA",
        "T2b_N0i+_M0": "ⅡB",

        "T1_N1_M0": "ⅢA1",
        "T1a_N1_M0": "ⅢA1",
        "T1b_N1_M0": "ⅢA1",
        "T1c_N1_M0": "ⅢA1",
        "T1c1_N1_M0": "ⅢA1",
        "T1c2_N1_M0": "ⅢA1",
        "T1c3_N1_M0": "ⅢA1",
        "T2_N1_M0": "ⅢA1",
        "T2a_N1_M0": "ⅢA1",
        "T2b_N1_M0": "ⅢA1",

        "T1_N1a_M0": "ⅢA1",
        "T1a_N1a_M0": "ⅢA1",
        "T1b_N1a_M0": "ⅢA1",
        "T1c_N1a_M0": "ⅢA1",
        "T1c1_N1a_M0": "ⅢA1",
        "T1c2_N1a_M0": "ⅢA1",
        "T1c3_N1a_M0": "ⅢA1",
        "T2_N1a_M0": "ⅢA1",
        "T2a_N1a_M0": "ⅢA1",
        "T2b_N1a_M0": "ⅢA1",

        "T1_N1b_M0": "ⅢA1",
        "T1a_N1b_M0": "ⅢA1",
        "T1b_N1b_M0": "ⅢA1",
        "T1c_N1b_M0": "ⅢA1",
        "T1c1_N1b_M0": "ⅢA1",
        "T1c2_N1b_M0": "ⅢA1",
        "T1c3_N1b_M0": "ⅢA1",
        "T2_N1b_M0": "ⅢA1",
        "T2a_N1b_M0": "ⅢA1",
        "T2b_N1b_M0": "ⅢA1",

        "T3a_N0_M0": "ⅢA2",
        "T3a_N0i+_M0": "ⅢA2",
        "T3a_N1_M0": "ⅢA2",
        "T3a_N1a_M0": "ⅢA2",
        "T3a_N1b_M0": "ⅢA2",

        "T3b_N0_M0": "ⅢB",
        "T3b_N0i+_M0": "ⅢB",
        "T3b_N1_M0": "ⅢB",
        "T3b_N1a_M0": "ⅢB",
        "T3b_N1b_M0": "ⅢB",

        "T3c_N0_M0": "ⅢC",
        "T3c_N0i+_M0": "ⅢC",
        "T3c_N1_M0": "ⅢC",
        "T3c_N1a_M0": "ⅢC",
        "T3c_N1b_M0": "ⅢC",
        
    
        "AnyT_AnyN_M1": "Ⅳ",
        "AnyT_AnyN_M1a": "ⅣA",
        "AnyT_AnyN_M1b": "ⅣB"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"FIGO:Ⅳ,远处转移,包括胸腔积液细胞学阳性，肝脏、脾脏实质的转移，腹腔外器官的转移(包括腹股沟淋巴结及腹腔外淋巴结)，肠壁受累",
        "M1a": "FIGO:ⅣA,远处转移,胸腔积液细胞学阳性",
        "M1b": "FIGO:ⅣB,远处转移,肝脏、脾脏实质的转移，腹腔外器官的转移（包括腹股沟淋巴结及腹腔外淋巴结），肠壁受累"
      },

      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1": "FIGO:Ⅰ,肿瘤局限于（单侧或双侧）卵巢（输卵管）",
        "T1a": "FIGO:ⅠA,肿瘤局限于一侧卵巢（输卵管），包膜完整，腹水或腹腔冲洗液中无恶性细胞",
        "T1b": "FIGO:ⅠB,肿瘤局限于一侧或两侧卵巢(输卵管)，包膜完整，卵巢或输卵管表面无肿瘤，腹水或腹腔冲洗液中无恶性细胞",
        "T1c": "FIGO:ⅠC,肿瘤局限于一侧或两侧卵巢（输卵管）,术中包膜破裂、术前包膜破裂或者卵巢（输卵管）表面有肿瘤、腹水或腹腔冲洗液中有恶性细胞",
        "T1c1": "FIGO:ⅠC1,肿瘤局限于一侧或两侧卵巢（输卵管）,术中包膜破裂",
        "T1c2": "FIGO:ⅠC2,肿瘤局限于一侧或两侧卵巢（输卵管）,术前包膜破裂或者卵巢（输卵管）表面有肿瘤",
        "T1c3": "FIGO:ⅠC3,肿瘤局限于一侧或两侧卵巢（输卵管）,腹水或腹腔冲洗液中有恶性细胞",

        "T2":"FIGO:Ⅱ,一侧或两侧卵巢，有盆腔浸润和/或种植",
        "T2a": "FIGO:ⅡA,直接浸润和/或种植到子宫和/或输卵管，和/或卵巢",
        "T2b": "FIGO:ⅡB,直接浸润和/或种植到盆腔其它组织",
        
        "T3": "FIGO:Ⅲ,一侧或两侧卵巢(输卵管/腹膜癌)，伴镜下证实的盆腔以外的腹膜转移，和/或腹膜后(盆腔和/或腹主动脉旁)淋巴结转移",
        "T3a":"FIGO:ⅢA,镜下可见的盆腔外腹腔转移，伴或不伴有腹膜后淋巴结转移",
        "T3b": "FIGO:ⅢB,肉眼可见的盆腔外腹腔转移，转移灶最大径小于或等于 2cm，伴或不伴腹膜后淋巴结转移",
        "T3c": "FIGO:ⅢC,肉眼可见的盆腔外腹腔转移，转移灶最大径大于 2cm，伴或不伴腹膜后淋巴结转移"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N0i+": "区域淋巴结中孤立的肿瘤细胞群≤0.2mm",
        "N1": "FIGO:ⅢA1,有腹膜后淋巴结转移（组织学证实）",
        "N1a": "FIGO:ⅢA1i,转移灶最大径达到 10mm",
        "N1b": "FIGO:ⅢA1ii,转移灶最大径超过 10mm" 
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

