var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1","Tis","T2", "T3", "T4"],
        "N": ["NX", "N0", "N1", "N2", "N3"]
      },
      
      "Table": {
        "Tis_N0_M0": "0",        
        "T1_N0_M0": "I",
        "T0_N1_M0": "II",
        "T1_N1_M0": "II",
        "T2_N0_M0": "II",
        "T2_N1_M0": "II",

        "T0_N2_M0": "III",
        "T1_N2_M0": "III",
        "T2_N2_M0": "III",

        "T3_N0_M0": "III",
        "T3_N1_M0": "III",
        "T3_N2_M0": "III",

        "T4_N0_M0": "IVA",
        "T4_N1_M0": "IVA",
        "T4_N2_M0": "IVA",

        "AnyT_N3_M0": "IVA",
        "AnyT_AnyN_M1": "IVB"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"未发现肿瘤，但有EBV阳性且有颈转移淋巴结",
        "Tis":"原位癌",
        "T1":"肿瘤局限于鼻咽、或侵犯口咽和／或鼻腔，无咽旁间隙受累",
        "T2":"肿瘤侵犯咽旁间隙，和／或邻近软组织受累（翼内肌、翼外肌、椎前肌）",
        "T3":"肿瘤侵犯颅底骨质结构、颈椎、翼状结构，和／或鼻旁窦",
        "T4":"肿瘤侵犯至颅内，有颅神经、下咽、眼眶、腮腺受累，和／或有超过翼外肌的外侧缘的广泛软组织侵犯"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N1": "单侧颈部和／ 或咽后淋巴结转移（不论侧数）：最大径≤６ｃｍ，且位于环状软骨下缘以上区域",
        "N2": "双侧颈淋巴结转移：最大径≤６ ｃｍ，位于且环状软骨下缘以上区域",
        "N3": "颈淋巴结转移（不论侧数）：最大径＞６ ｃｍ 和（或）位于环状软骨下缘以下区域"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

