var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1", "T1a", "T1b", "T2", "T2a", "T2b", "T3", "T3a", "T3b", "T3c","T4"],
        "N": ["NX", "N0", "N1"]
      },

      "Table": {
        "T1_N0_M0": "Ⅰ",  
        "T1a_N0_M0": "Ⅰ",  
        "T1b_N0_M0": "Ⅰ",
        
        "T2_N0_M0": "Ⅱ",
        "T2a_N0_M0": "Ⅱ",
        "T2b_N0_M0": "Ⅱ",

        "T1_N1_M0": "Ⅲ",
        "T1a_N1_M0": "Ⅲ",
        "T1b_N1_M0": "Ⅲ",

        "T2_N1_M0": "Ⅲ",
        "T2a_N1_M0": "Ⅲ",
        "T2b_N1_M0": "Ⅲ",

        "T3_N0_M0": "Ⅲ",
        "T3a_N0_M0": "Ⅲ",
        "T3b_N0_M0": "Ⅲ",
        "T3c_N0_M0": "Ⅲ",

        "T3_N1_M0": "Ⅲ",
        "T3a_N1_M0": "Ⅲ",
        "T3b_N1_M0": "Ⅲ",
        "T3c_N1_M0": "Ⅲ",

        "T4_AnyN_M0": "Ⅳ",
  
        "AnyT_AnyN_M1": "Ⅳ"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1": "肿瘤最大径≤7cm，局限于肾脏",
        "T1a":"肿瘤最大径≤4cm 肿瘤，局限于肾",
        "T1b":"4cm＜肿瘤最大径≤7cm，局限于肾",
        "T2": "最大径＞7cm，局限于肾脏",
        "T2a":"7cm＜肿瘤最大径≤10cm，局限于肾",
        "T2b":"最大径＞10cm，局限于肾脏",
        "T3": "肿瘤侵犯主要静脉，或者肾周软组织，但是未侵及同侧的肾上腺和未超出 Gerota’s筋膜",
        "T3a": "肿瘤侵犯肾静脉或其主要分支，或侵及肾盂，或肾周和/或肾窦脂肪组织，但未超出Gerota’s 筋膜",
        "T3b": "肿瘤延伸至横膈以下腔静脉",
        "T3c": "肿瘤延伸至横膈以上腔静脉，或侵犯腔静脉壁",
        "T4": "肿瘤已超出肾筋脉(Gerota’s 筋膜)"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N1": "区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

