var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1a", "M1b"],
        "T": ["TX", "T0", "T1","T2"],
        "N": []
      },
    
      "Table": {
        "T1_M0": "Ⅰ",        
        "T2_M0": "Ⅱ",  
        "AnyT_M1a": "Ⅲ",          
        "AnyT_M1b": "Ⅳ"
      },
      "M": {
        "M0":"无远处转移",       
        "M1a": "远处转移,肺转移",
        "M1b": "远处转移,其他器官转移"
      },

      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1": "肿瘤局限于子宫",
        "T2":"肿瘤累及其他结构（卵巢，输卵管，阴道，阔韧带等）"
      },
      "N": {
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

