var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1", "M1a", "M1b", "M1c"],
        "T": ["TX", "T1", "T2", "T3", "T4"],
        "N": ["NX", "N0", "N1"]
      },
 
      "Table": { 
        "T1_N0_M0": "Ⅰ",
        "T2_N0_M0": "Ⅱ",
        "T3_N0_M0": "Ⅱ",
        "T4_N0_M0":  "Ⅲ",

        "AnyT_N1_M0": "Ⅲ",

        "AnyT_AnyN_M1": "Ⅳ",
        "AnyT_AnyN_M1a": "Ⅳ",
        "AnyT_AnyN_M1b": "Ⅳ",
        "AnyT_AnyN_M1c": "Ⅳ"  
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移",
        "M1a": "转移局限于肝脏内",
        "M1b": "肝脏以外转移，至少一个(如肺，卵巢，非区域淋巴结，腹膜，骨)",
        "M1c": "同时存在肝脏和肝外器官转移"   
      },
      "T": {
        "TX": "原发肿瘤无法评估",        
        "T1": "(十二指肠)肿瘤侵及黏膜层或黏膜下层，肿瘤大小≤1cm;(Vater 壶腹)肿瘤局限于 Oddi括约肌,肿瘤大小≤1cm",
        "T2": "(十二指肠)肿瘤侵及固有肌层，或肿瘤大小＞1cm;(Vater 壶腹)肿瘤通过Oddi括约肌，侵及十二指肠黏膜或固有肌层，或肿瘤大小＞1cm",
        "T3": "肿瘤侵及胰腺，或胰腺周围组织",
        "T4": "肿瘤侵及腹膜或其它器官"
      },
      "N": {
        "NX":"淋巴结转移情况无法判断",
        "N0":"无区域淋巴结转移",
        "N1":"有区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

