var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1a", "M1b", "M1c"],
        "T": ["TX", "T0", "Tis", "T1", "T2", "T3", "T4a", "T4b"],
        "N": ["NX", "N0", "N1a", "N1b", "N1c", "N2a", "N2b",]
      },
      
      "Table": {
        "Tis_N0_M0": "0",
        "T1_N0_M0": "I",
        "T2_N0_M0": "I",
        "T3_N0_M0": "IIA",
        "T4a_N0_M0": "IIB",
        "T4b_N0_M0": "IIC",

        "T1_N1a_M0": "IIIA",
        "T2_N1a_M0": "IIIA",
        "T1_N1b_M0": "IIIA",
        "T2_N1b_M0": "IIIA",
        "T1_N1c_M0": "IIIA",
        "T2_N1c_M0": "IIIA",

        "T1_N2a_M0": "IIIA",

        "T3_N1a_M0": "IIIB",
        "T4a_N1a_M0": "IIIB",
        "T3_N1b_M0": "IIIB",
        "T4a_N1b_M0": "IIIB",
        "T3_N1c_M0": "IIIB",
        "T4a_N1c_M0": "IIIB",

        "T2_N2a_M0": "IIIB",
        "T3_N2a_M0": "IIIB",

        "T1_N2b_M0": "IIIB",
        "T2_N2b_M0": "IIIB",

        "T4a_N2a_M0": "IIIC",
        "T3_N2b_M0": "IIIC",
        "T4a_N2b_M0": "IIIC",

        "T4b_N1a_M0": "IIIC",
        "T4b_N1b_M0": "IIIC",
        "T4b_N1c_M0": "IIIC",
        "T4b_N2a_M0": "IIIC",
        "T4b_N2b_M0": "IIIC",

        "M1a": "IVA",
        "M1b": "IVB",
        "M1c": "IVC"
      },
      "M": {
        "M0":"无远处转移(影像学证实的)",
        "M1a":"有 1 个位置或 1 个器官转移，无腹膜转移",  
        "M1b": "有 2 个或更多的位点/器官转移，无腹膜转移",
        "M1c": "有腹膜转移，伴/不伴其它器官转移",       },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "Tis": "原位癌：局限于上皮内或侵犯黏膜固有层",
        "T1":"肿瘤侵犯黏膜下层",
        "T2":"肿瘤侵犯固有肌层",
        "T3":" 肿瘤穿透固有肌层到达浆膜下层，或侵犯无腹膜覆盖的结直肠旁组织",
        "T4a": "肿瘤穿透腹膜脏层",
        "T4b": "肿瘤直接侵犯或粘连于其他器官或结构"       
      },
      "N": {
        "NX":"淋巴结转移情况无法判断",
        "N0":"无区域淋巴结转移",
        "N1a":"1个区域淋巴结转移",
        "N1b": "2-3个区域淋巴结转移",
        "N1c": "无区域淋巴结转移，但是在浆膜下、肠系膜或者无腹膜覆盖的结直肠周围组织中发现癌结节",
        "N2a": "4-6个区域淋巴结转移",
        "N2b": "7个及更多区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

