var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "Tis", "T1a", "T1b", "T1c", "T2", "T3", "T4"],
        "N": ["NX", "N0", "N1", "N2"]
      },
      
      "Table": {
        "Tis_N0_M0": "0",
        "T1a_N0_M0": "IA",
        "T1b_N0_M0": "IA",
        "T1c_N0_M0": "IA",
        "T2_N0_M0": "IB",
        "T3_N0_M0": "IIA",

        "T1a_N1_M0": "IIB",
        "T1b_N1_M0": "IIB",
        "T1c_N1_M0": "IIB",
        "T2_N1_M0": "IIB",
        "T3_N1_M0": "IIB",

        "T1a_N2_M0": "III",
        "T1b_N2_M0": "III",
        "T1c_N2_M0": "III",
        "T2_N2_M0": "III",
        "T3_N2_M0": "III",
        "T3_N2_M0": "III",

        "T4_M0": "III",
        "M1": "IV",
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "Tis": "原位癌(包括高级别导管上皮内瘤变,导管内乳头状黏液性肿瘤伴重度异型增生,导管内管状乳头状肿瘤伴重度异型增生, 黏液性囊性肿瘤伴有重度异型增生)",
        "T1a":"肿瘤最大径≤0.5cm",
        "T1b":"0.5cm＜肿瘤最大径≤1cm",
        "T1c": "1cm＜肿瘤最大径≤2cm",
        "T2":"2cm＜肿瘤最大径≤4cm",
        "T3":"肿瘤最大径＞4cm",
        "T4": "肿瘤侵及腹腔动脉，肠系膜上动脉，和/或肝总动脉，无论肿瘤大小"
      },
      "N": {
        "NX":"淋巴结转移情况无法判断",
        "N0":"无区域淋巴结转移",
        "N1":"1-3个区域淋巴结转移",
        "N2": "4个及以上区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

