var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1", "T1a", "T1a1", "T1a2", "T1b", "T1b1", "T1b2", "T2", "T2a", "T2a1", "T2a2", "T2b", "T2b1", "T2b2", "T3", "T3a", "T3b", "T4"],
        "N": ["NX", "N0", "N0(i+)", "N1"]
      },

      "Table": {
        "T1_M0": "Ⅰ",
        "T1a_M0": "ⅠA",
        "T1a1_M0": "ⅠA1",
        "T1a2_M0": "ⅠA2",
        "T1b_M0": "ⅠB",
        "T1b1_M0": "ⅠB1",
        "T1b2_M0": "ⅠB2",
        "T2_M0": "Ⅱ",
        "T2a_M0": "ⅡA",
        "T2a1_M0": "ⅡA1",
        "T2a2_M0": "ⅡA2",
        "T2b_M0": "ⅡB",
        "T3_M0": "Ⅲ",
        "T3a_M0": "ⅢA",
        "T3b_M0": "ⅢB",
        "T4_M0": "ⅣA",        
        "M1": "ⅣB",
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移(包括腹腔内播散，锁骨上、纵膈或远处淋巴结，肺肝骨转移)"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1": "肿瘤局限于宫颈",
        "T1a":"镜下可见的浸润性癌，浸润深度≤5mm，宽度≤7mm, 脉管内瘤栓不影响分期",
        "T1a1": "镜下可见的浸润性癌，浸润深度≤3mm，宽度≤7mm, 脉管内瘤栓不影响分期",
        "T1a2": "镜下可见的浸润性癌，3mm＜浸润深度≤5mm，宽度≤7mm, 脉管内瘤栓不影响分期",
        "T1b":"临床可见的局限于宫颈的肿瘤；或者镜下可见的，超出 T1a 范围的",
        "T1b1": "临床可见的局限于宫颈的肿瘤；临床可见的，病变大小≤4cm",
        "T1b2": "临床可见的局限于宫颈的肿瘤；临床可见的，病变最大径＞4cm",
        "T2":"肿瘤侵犯超出子宫颈，但未达到骨盆壁，或者阴道下 1/3",
        "T2a":"无宫旁浸润",
        "T2a1": "临床可见的，病变最大径≤4cm",
        "T2a2": "临床可见的，病变最大径＞4cm",
        "T2b": "有宫旁浸润",
        "T3":"肿瘤扩展至盆壁，和/或阴道下 1/3，和/或引起肾积水或无功能肾",
        "T3a": "肿瘤侵及阴道下 1 / 3，但未侵及盆壁",
        "T3b": "肿瘤侵及盆壁，和/或引起肾积水或无功能肾",
        "T4": "肿瘤侵犯超出骨盆，侵及膀胱或直肠黏膜（不包括泡状水肿）"
      },
      "N": {
        "NX":"淋巴结转移情况无法判断",
        "N0":"无区域淋巴结转移",
        "N0(i+)":"区域淋巴结中孤立的肿瘤细胞群≤0.2mm",
        "N1": "区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

