var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1", "M1a", "M1b", "M1c"],
        "T": ["TX", "T1", "T2", "T3", "T4"],
        "N": ["NX", "N0", "N1"]
      },
 
      "Table": { 
        "T1_N0_M0": "Ⅰ",
        "T2_N0_M0": "Ⅱ",
        "T3_N0_M0": "Ⅱ",
        "T4_N0_M0":  "Ⅲ",

        "AnyT_N1_M0": "Ⅲ",

        "AnyT_AnyN_M1": "Ⅳ",
        "AnyT_AnyN_M1a": "Ⅳ",
        "AnyT_AnyN_M1b": "Ⅳ",
        "AnyT_AnyN_M1c": "Ⅳ"  
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移",
        "M1a": "转移局限于肝脏内",
        "M1b": "肝脏以外转移，至少一个(如肺，卵巢，非区域淋巴结，腹膜，骨)",
        "M1c": "同时存在肝脏和肝外器官转移"   
      },
      "T": {
        "TX": "原发肿瘤无法评估",        
        "T1": "肿瘤局限于胰腺,＜2cm",
        "T2": "肿瘤局限于胰腺，2-4cm",
        "T3": "肿瘤局限于胰腺，＞4cm，或者肿瘤侵及十二指肠或胆囊",
        "T4": "肿瘤侵及邻近器官（胃，脾脏，结肠，肾上腺），或者大动脉(腹腔动脉、肠系膜上动脉)"
      },
      "N": {
        "NX":"淋巴结转移情况无法判断",
        "N0":"无区域淋巴结转移",
        "N1":"有区域淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

