var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0","Tis","T1a", "T1b", "T2", "T3", "T4"],
        "N": ["NX", "N0", "N1"]
      },
    
      "Table": {
        "Tis_N0_M0": "0",
        "T1a_N0_M0": "ⅠA",  
        "T1b_N0_M0": "ⅠB",  
        "T2_N0_M0": "Ⅱ", 

        "T3_N0_M0": "ⅢA",
        
        "T4_N0_M0": "ⅢB",

        "AnyT_N1_M0": "ⅢB",

        "AnyT_AnyN_M1": "Ⅳ"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"
      },

      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "Tis": "原位癌",        
        "T1a": "孤立的肿瘤最大径≤5cm，无血管侵犯",
        "T1b": "孤立的肿瘤最大径＞5cm，无血管侵犯",     
        "T2":"孤立的肿瘤,有血管侵犯；或者多发的肿瘤，有/无血管侵犯", 
        "T3": "肿瘤穿透脏层腹膜", 
        "T4": "直接侵犯局部肝外结构"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",       
        "N1": "区域淋巴结转移" 
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

