var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1", "T1a", "T1b", "T2", "T3", "T3a", "T3b", "T4"],
        "N": ["NX", "N0", "N0i+", "N1", "N1mi", "N1a", "N2", "N2mi", "N2a"]
      },

      "Table": {
        "T1_N0_M0": "Ⅰ",
        "T1a_N0_M0": "ⅠA",  
        "T1b_N0_M0": "ⅠB",  

        "T2_N0_M0": "Ⅱ",

        "T3_N0_M0": "Ⅲ",
        "T3a_N0_M0": "ⅢA",
        "T3b_N0_M0": "ⅢB",

        "T1_N1_M0": "ⅢC1", 
        "T1a_N1_M0": "ⅢC1",
        "T1b_N1_M0": "ⅢC1",
        "T2_N1_M0": "ⅢC1",
        "T3_N1_M0": "ⅢC1",
        "T3a_N1_M0": "ⅢC1",
        "T3b_N1_M0": "ⅢC1",

        "T1_N1mi_M0": "ⅢC1",
        "T1a_N1mi_M0": "ⅢC1",
        "T1b_N1mi_M0": "ⅢC1",
        "T2_N1mi_M0": "ⅢC1",
        "T3_N1mi_M0": "ⅢC1",
        "T3a_N1mi_M0": "ⅢC1",
        "T3b_N1mi_M0": "ⅢC1",

        "T1_N1a_M0": "ⅢC1",
        "T1a_N1a_M0": "ⅢC1",
        "T1b_N1a_M0": "ⅢC1",
        "T2_N1a_M0": "ⅢC1",
        "T3_N1a_M0": "ⅢC1",
        "T3a_N1a_M0": "ⅢC1",
        "T3b_N1a_M0": "ⅢC1",

        "T1_N2_M0": "ⅢC2",
        "T1a_N2_M0": "ⅢC2",
        "T1b_N2_M0": "ⅢC2",
        "T2_N2_M0": "ⅢC2",
        "T3_N2_M0": "ⅢC2",
        "T3a_N2_M0": "ⅢC2",
        "T3b_N2_M0": "ⅢC2", 

        "T1_N2mi_M0": "ⅢC2",
        "T1a_N2mi_M0": "ⅢC2",
        "T1b_N2mi_M0": "ⅢC2",
        "T2_N2mi_M0": "ⅢC2",
        "T3_N2mi_M0": "ⅢC2",
        "T3a_N2mi_M0": "ⅢC2",
        "T3b_N2mi_M0": "ⅢC2", 

        "T1_N2a_M0": "ⅢC2",
        "T1a_N2a_M0": "ⅢC2",
        "T1b_N2a_M0": "ⅢC2",
        "T2_N2a_M0": "ⅢC2",
        "T3_N2a_M0": "ⅢC2",
        "T3a_N2a_M0": "ⅢC2",
        "T3b_N2a_M0": "ⅢC2",  
        
        "T4_AnyN_M0": "ⅣA",
     
        "AnyT_AnyN_M1": "ⅣB"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移(包括转移至腹股沟淋巴结、腹腔脏器、肺肝或骨等；不包括转移至盆腔或主动脉旁淋巴结、阴道、盆壁腹膜或附件)"
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1": "肿瘤局限于子宫内膜，包括侵及颈管内膜",
        "T1a":"肿瘤局限于内膜层或浸润不超过肌壁的 1/2",
        "T1b":"肿瘤浸润达到或超过肌壁的 1/2",
        "T2":"肿瘤浸润宫颈间质但没有超出子宫",
        "T3":"肿瘤侵犯浆膜，附件，阴道或宫旁组织",
        "T3a":"肿瘤侵及浆膜层，和/或附件(直接延伸或转移)",
        "T3b":"肿瘤侵及阴道或宫旁组织",
        "T4":"肿瘤侵犯膀胱黏膜和/或肠黏膜（不包括泡状水肿）"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N0i+": "区域淋巴结中孤立的肿瘤细胞群≤0.2mm",
        "N1": "盆腔淋巴结转移",
        "N1mi": "盆腔淋巴结转移（0.2≤转移灶≤2.0mm）",
        "N1a": "盆腔淋巴结转移（转移灶＞2.0mm）",
        "N2": "腹主动脉旁淋巴结转移，伴/不伴盆腔淋巴结阳性",
        "N2mi": "腹主动脉旁淋巴结转移（0.2≤转移灶≤2.0mm），伴/不伴盆腔淋巴结阳性",
        "N2a": "腹主动脉旁淋巴结转移（转移灶＞2.0mm），伴/不伴盆腔淋巴结阳性"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

