var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1", "T1a", "T1b", "T2", "T3"],
        "N": ["NX", "N0", "N0i+", "N1a", "N1b", "N2a", "N2b", "N2c", "N3"]
      },

      "Table": {
        "T1_N0_M0": "Ⅰ",
        "T1a_N0_M0": "ⅠA",  
        "T1b_N0_M0": "ⅠB",  

        "T2_N0_M0": "Ⅱ",

        "T1_N1_M0": "ⅢA",
        "T1a_N1_M0": "ⅢA",
        "T1b_N1_M0": "ⅢA",
        "T2_N1_M0": "ⅢA",

        "T1_N2a_M0": "ⅢB",
        "T1a_N2a_M0": "ⅢB",
        "T1b_N2a_M0": "ⅢB",
        "T2_N2a_M0": "ⅢB",
        "T1_N2b_M0": "ⅢB",
        "T1a_N2b_M0": "ⅢB",
        "T1b_N2b_M0": "ⅢB",
        "T2_N2b_M0": "ⅢB",

        "T1_N2c_M0": "ⅢC",
        "T1a_N2c_M0": "ⅢC",
        "T1b_N2c_M0": "ⅢC",
        "T2_N2c_M0": "ⅢC",

        "T1_N3_M0": "ⅣA",
        "T1a_N3_M0": "ⅣA",
        "T1b_N3_M0": "ⅣA",
        "T2_N3_M0": "ⅣA",
 
        "T3_AnyN_M0": "ⅣA",
     
        "AnyT_AnyN_M1": "ⅣB",
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移（包括盆腔淋巴结转移）"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1": "肿瘤局限于外阴和/或者会阴",
        "T1a":"病灶≤2cm，局限于外阴和/或会阴，间质浸润≤1mm",
        "T1b":"病灶＞2cm，局限于外阴和/或会阴；或者任何肿瘤大小，间质浸润＞1mm",
        "T2":"肿瘤侵犯邻近结构（远端三分之一的尿道、阴道、肛门受累）",
        "T3": "任何大小的肿瘤，侵犯以下：近端三分之二的尿道/阴道、膀胱黏膜或者直肠黏膜，或者侵犯盆骨"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N0i+": "区域淋巴结中孤立的肿瘤细胞群≤0.2mm",
        "N1a": "1 或 2 个区域淋巴结转移，均＜5mm",
        "N1b": "1 个区域淋巴结转移，＝5mm",
        "N2a": "3 个或者以上的淋巴结转移，均＜5mm",
        "N2b": "2 个或者以上的淋巴结转移，＝5mm",
        "N2c": "淋巴结外侵犯",
        "N3": "区域淋巴结转移伴黏连或溃疡形成"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

