var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "Tis", "T1", "T2", "T3","T4a", "T4b"],
        "N": ["NX","N0","N1","N2a","N2b","N2c","N3a", "N3b"]
      },
    
      "Table": {
        "Tis_N0_M0": "0",
        "T1_N0_M0": "Ⅰ",         
        "T2_N0_M0": "Ⅱ", 
        "T3_N0_M0": "Ⅲ", 

        "T1_N1_M0": "Ⅲ",
        "T2_N1_M0": "Ⅲ",
        "T3_N1_M0": "Ⅲ",

        "T4a_N0_M0": "ⅣA",
        "T4a_N1_M0": "ⅣA",

        "T1_N2a_M0": "ⅣA",
        "T1_N2b_M0": "ⅣA",
        "T1_N2c_M0": "ⅣA",
        "T2_N2a_M0": "ⅣA",
        "T2_N2b_M0": "ⅣA",
        "T2_N2c_M0": "ⅣA",
        "T3_N2a_M0": "ⅣA",
        "T3_N2b_M0": "ⅣA",
        "T3_N2c_M0": "ⅣA",
        "T4a_N2a_M0": "ⅣA",
        "T4a_N2b_M0": "ⅣA",
        "T4a_N2c_M0": "ⅣA",
  
        "AnyT_N3a_M0": "ⅣB",  
        "AnyT_N3b_M0": "ⅣB",  
        "T4b_AnyN_M0": "ⅣB",             
    
        "AnyT_AnyN_M1": "ⅣC"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"
      },

      "T": {
        "TX":"原发肿瘤无法评估",
        "Tis": "原位癌",
        "T1": "(上颌窦)肿瘤局限于上颌窦黏膜，无骨的侵蚀或破坏|(鼻腔和筛窦)肿瘤局限于任何一个部位，有或无骨侵袭",          
        "T2": "(上颌窦)肿瘤侵蚀或破坏骨，包括侵犯硬腭和/或中鼻道，不包括上颌窦后壁及翼突内侧板|(鼻腔和筛窦)肿瘤在单一区域侵犯两个部位或延伸到复杂的鼻筛部相邻的区域，有或无骨侵袭",       
        "T3": "(上颌窦)肿瘤侵犯下列任何之一：上颌窦后壁，皮下组织，眶底或眶内侧壁，翼窝，筛窦|(鼻腔和筛窦)肿瘤侵犯眶内侧壁或眶底，上颌窦，上颚，筛状板", 
        "T4a": "(上颌窦)中度进展期。肿瘤侵犯眶内容物，面颊皮肤，翼突内侧板，颞下窝，筛状板，蝶窦或者额窦|(鼻腔和筛窦)中度进展期。肿瘤侵犯眶内容物，鼻或面颊皮肤，颅前窝，翼状板，蝶窦或者额窦",
        "T4b": "(上颌窦、鼻腔和筛窦)高度进展期。肿瘤侵犯下列任何之一：眶尖，硬脑膜，脑，颅中窝，颅神经，三叉神经上颌支，鼻咽，斜坡"
      },
      "N": {
        "NX":"无法评估有无区域性淋巴结转移",
        "N0":"无区域淋巴结转移",       
        "N1": "同侧单个淋巴结转移,最大径≤3cm,ENE（-）",
        "N2a": "同侧或对侧单个淋巴结转移,最大径≤3cm，ENE(+)；同侧单个淋巴结转移,3cm＜最大径≤6cm，ENE(-)",
        "N2b": "同侧多个淋巴结转移,最大径≤6cm,ENE(-)" ,
        "N2c": "双侧或对侧淋巴结转移,最大径≤6cm,ENE(-)",
        "N3a": "转移淋巴结中最大径＞6cm,ENE(-)",
        "N3b": "同侧单个淋巴结转移，最大径＞3cm，ENE(+)；同侧多个淋巴结，对侧或者双侧淋巴结转移,ENE(+)"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

