var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1"],
        "T": ["TX", "T0", "T1a", "T1b", "T2a", "T2b", "T3", "T4"],
        "N": ["NX", "N0", "N0i+", "N1"]
      },

      "Table": {
        "T1a_N0_M0": "ⅠA",  
        "T1b_N0_M0": "ⅠB",  

        "T2a_N0_M0": "ⅡA",
        "T2b_N0_M0": "ⅡB",

        "T1a_N1_M0": "Ⅲ",
        "T1b_N1_M0": "Ⅲ",
        "T2a_N1_M0": "Ⅲ",
        "T2b_N1_M0": "Ⅲ",
        "T3_N1_M0": "Ⅲ",

        "T3_N0_M0": "Ⅲ",
        "T4_AnyN_M0": "ⅣA",
  
        "AnyT_AnyN_M1": "ⅣB"
      },
      "M": {
        "M0":"无远处转移",
        "M1":"有远处转移"    
      },
      "T": {
        "TX":"原发肿瘤无法评估",
        "T0":"无原发肿瘤证据",
        "T1a":"肿瘤≤2cm，局限于阴道",
        "T1b":"肿瘤＞2cm，局限于阴道",
        "T2a":"肿瘤侵犯阴道旁组织，未侵及盆壁，大小≤2cm",
        "T2b":"肿瘤侵犯阴道旁组织，未侵及盆壁，大小＞2cm",
        "T3":"肿瘤侵犯盆壁，和/或侵犯远端三分之一阴道和/或引起肾盂积水或者无功能肾",
        "T4": "肿瘤侵犯膀胱或者直肠黏膜，和/或超出了真性骨盆"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N0i+": "区域淋巴结中孤立的肿瘤细胞群≤0.2mm",
        "N1": "盆腔和腹股沟淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

