var tnmlist = [
  {
    "th8": {
      "orderedKeys": {
        "M": ["M0", "M1a", "M1b"],
        "T": ["TX", "T0", "Ta", "Tis", "T1", "T2a", "T2b", "T3a", "T3b", "T4a", "T4b"],
        "N": ["NX", "N0", "N1", "N2", "N3"]
      },

      "Table": {
        "Ta_N0_M0": "0a",  
        "Tis_N0_M0": "0is",  
        "T1_N0_M0": "Ⅰ",
        
        "T2a_N0_M0": "Ⅱ",
        "T2b_N0_M0": "Ⅱ",

        "T3a_N0_M0": "ⅢA",
        "T3b_N0_M0": "ⅢA",
        "T4a_N0_M0": "ⅢA",

        "T1_N1_M0": "ⅢA",
        "T2a_N1_M0": "ⅢA",
        "T2b_N1_M0": "ⅢA",
        "T3a_N1_M0": "ⅢA",
        "T3b_N1_M0": "ⅢA",
        "T4a_N1_M0": "ⅢA",

        "T1_N2_M0": "ⅢB",
        "T2a_N2_M0": "ⅢB",
        "T2b_N2_M0": "ⅢB",
        "T3a_N2_M0": "ⅢB",
        "T3b_N2_M0": "ⅢB",
        "T4a_N2_M0": "ⅢB",

        "T1_N3_M0": "ⅢB",
        "T2a_N3_M0": "ⅢB",
        "T2b_N3_M0": "ⅢB",
        "T3a_N3_M0": "ⅢB",
        "T3b_N3_M0": "ⅢB",
        "T4a_N3_M0": "ⅢB",

        "T4b_N0_M0": "ⅣA",       
  
        "AnyT_AnyN_M1a": "ⅣA",
        "AnyT_AnyN_M1b": "ⅣB"
      },
      "M": {
        "M0": "无远处转移",
        "M1a": "超过髂总动脉的淋巴结转移" ,   
        "M1b": "非淋巴结远处转移" 
      },
      "T": {
        "TX": "原发肿瘤无法评估",
        "T0": "无原发肿瘤证据",
        "Ta": "非浸润性乳头状尿路上皮癌",
        "Tis": "原位癌(平坦肿瘤)",
        "T1": "肿瘤浸润固有层(上皮下结缔组织)",
        "T2a": "肿瘤浸润浅肌层（内侧 1/2 肌层）",
        "T2b": "肿瘤浸润深肌层（外侧 1/2 肌层）",
        "T3a": "肿瘤浸润膀胱周围组织,显微镜可见",
        "T3b": "肿瘤浸润膀胱周围组织,肉眼可见（膀胱外肿块）",
        "T4a": "肿瘤浸润前列腺/子宫/阴道",
        "T4b": "肿瘤浸润盆壁/腹壁"
      },
      "N": {
        "NX":"无法评估区域淋巴结",
        "N0":"无区域淋巴结转移",
        "N1": "真骨盆单个区域淋巴结转移（膀胱周围、闭孔、髂内/外、骶前淋巴结转移）",
        "N2": "真骨盆多个区域淋巴结转移（膀胱周围、闭孔、髂内/外、骶前淋巴结转移）",
        "N3": "髂总动脉淋巴结转移"
      }
    }
  }
]
 
module.exports ={
  tnm: tnmlist
}

